SUB_RUBRICS = (
    (None, 'Выберите'),
    ('Транспортные средства', (
        ('Автомобили', 'Автомобили'),
        ('Автомобильные запчасти', 'Автомобильные запчасти'),
        ('Водный транспорт и запчасти','Водный транспорт и запчасти'),
        ('Прицепы и дома', 'Прицепы и дома'),
        ('Мотоциклы, малая техника и запчасти', 'Мотоциклы, малая техника и запчасти'),
        ('Воздушные транспортные средства и запчасти', 'Воздушные транспортные средства и запчасти'),
        ('Другие транспортные средства', 'Другие транспортные средства'),
    )),
    ('Электроника', (
        ('Компьютеры и комплектующие', 'Компьютеры и комплектующие'),
        ('Оргтехника', 'Оргтехника'),
        ('Фото и видео', 'Фото и видео'),
        ('Телефоны и планшеты', 'Телефоны и планшеты'),
        ('Телевизоры и ТВ-приставки', 'Телевизоры и ТВ-приставки'),
        ('Другая электроника', 'Другая электроника'),
    )),
    ('Недвижимость', (
        ('Квартиры', 'Квартиры'),
        ('Дома', 'Дома'),
        ('Комнаты', 'Комнаты'),
        ('Участки', 'Участки'),
        ('Коммерческая', 'Коммерческая'),
    )),
    ('Хозяйство', (
        ('Искусство и антиквариат', 'Искусство и антиквариат'),
        ('Детские товары и игрушки', 'Детские товары и игрушкит'),
        ('Одежда', 'Одежда'),
        ('Сад и огород', 'Сад и огород'),
        ('Инструмент', 'Инструмент'),
        ('Мебель', 'Мебель'),
        ('Домашний декор', 'Домашний декор'),
        ('Бытовая техника', 'Бытовая техника'),
    )),
    ('Досуг и хобби', (
        ('Журналы, книги и издания', 'Журналы, книги и издания'),
        ('Животные', 'Животные'),
        ('Хобби', 'Хобби'),
        ('Знакомства', 'Знакомства'),
        ('Охота и рыбалка', 'Охота и рыбалка'),
        ('Часы и ювелирные изделия', 'Часы и ювелирные изделия'),
        ('Музыкальные инструменты', 'Музыкальные инструменты'),
        ('Спорт', 'Спорт'),
    )),
    ('Работа', (
        ('Бухгалтерский учет и аудит', 'Бухгалтерский учет и аудит'),
        ('IT, администрирование и поддержка', 'IT, администрирование и поддержка'),
        ('Реклама и маркетинг', 'Реклама и маркетинг'),
        ('Искусство и развлечение', 'Искусство и развлечение'),
        ('Автомобилестроение и механика', 'Автомобилестроение и механика'),
        ('Уход за детьми', 'Уход за детьми'),
        ('Обслуживание', 'Обслуживание'),
        ('Здравоохранение', 'Здравоохранение'),
        ('Гостиничный бизнес и туризм', 'Гостиничный бизнес и туризм'),
        ('Мода и красота', 'Мода и красота'),
        ('Графический дизайн и САПР', 'Графический дизайн и САПР'),
        ('Управление персоналом', 'Управление персоналом'),
        ('Установка и техническое обслуживание', 'Установка и техническое обслуживание'),
        ('Интернет и электронная коммерция', 'Интернет и электронная коммерция'),
        ('Правоохранительные органы, гос.управление', 'Правоохранительные органы, гос.управление'),
        ('Производство', 'Производство'),
        ('Менеджмент и управление', 'Менеджмент и управление'),
        ('Строительство', 'Строительство'),
        ('Горнодобывающая промышленность', 'Горнодобывающая промышленность'),
        ('Издательское дело, журналистика и СМИ', 'Издательское дело, журналистика и СМИ'),
        ('Закупки и мерчендайзинг', 'Закупки и мерчендайзинг'),
        ('Рестораны и общественное питание', 'Рестораны и общественное питание'),
        ('Розничная и оптовая торговля', 'Розничная и оптовая торговля'),
        ('Транспортные и складские услуги', 'Транспортные и складские услуги'),
        ('Ветеринарные услуги', 'Ветеринарные услуги'),
        ('Работа на дому', 'Работа на дому'),

    )),

)
SUB_RUBRICS_ARR = ['Транспортные средства','Автомобили','Автомобильные запчасти','Водный транспорт и запчасти','Прицепы и дома',
                    'Мотоциклы, малая техника и запчасти','Воздушные транспортные средства и запчасти',
                    'Другие транспортные средства','Электроника','Компьютеры и комплектующие','Оргтехника','Фото и видео',
                    'Телефоны и планшеты','Телевизоры и ТВ-приставки','Другая электроника','Недвижимость','Квартиры','Дома','Комнаты',
            'Участки','Коммерческая','Хозяйство','Искусство и антиквариат','Детские товары и игрушки','Одежда','Сад и огород',
            'Инструмент','Мебель','Домашний декор','Бытовая техника','Досуг и хобби','Журналы, книги и издания','Животные','Хобби',
            'Знакомства','Охота и рыбалка','Часы и ювелирные изделия','Музыкальные инструменты','Спорт','Работа',
                   'Бухгалтерский учет и аудит','IT, администрирование и поддержка','Реклама и маркетинг','Искусство и развлечение',
                    'Автомобилестроение и механика','Уход за детьми','Обслуживание','Здравоохранение','Гостиничный бизнес и туризм',
                    'Мода и красота','Графический дизайн и САПР','Управление персоналом','Установка и техническое обслуживание',
                    'Интернет и электронная коммерция','Правоохранительные органы, гос.управление','Производство',
                    'Менеджмент и управление','Строительство','Горнодобывающая промышленность','Издательское дело, журналистика и СМИ',
                    'Закупки и мерчендайзинг','Рестораны и общественное питание','Розничная и оптовая торговля','Транспортные и складские услуги','Ветеринарные услуги','Работа на дому' ]




RUBRIC_ARR = ['Транспортные средства','Электроника','Недвижимость','Досуг и хобби','Хозяйство','Работа']

# < a href = "{% url 'by_subrubric' adv.subrubric %}" > {{r}} < / a >
# <a href="{% url 'by_subrubric' adv.rubric.pk adv.subrubric %}">{{ adv.subrubric }}</a>